package test

var PreTest = Test{
	Title:       "Pre-test",
	TotalPoints: 10,
	Questions: []Question{
		{
			Text:           "ข้อใดคือความหมายของการประเมินชุมชน",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "การรวบรวมข้อมูลประชากรในชุมชนเพื่อวิเคราะห์เชิงเศรษฐกิจและสังคม",
					IsCorrect: false,
				},
				{
					Text:      "การจัดทำโครงการสุขภาพในชุมชนโดยไม่พิจารณาปัญหาสุขภาพเบื้องต้น",
					IsCorrect: false,
				},
				{
					Text:      "การสรุปสภาพแวดล้อมและทรัพยากรในชุมชนโดยไม่เน้นการมีส่วนร่วมของประชาชน",
					IsCorrect: false,
				},
				{
					Text:      "การระบุสถานะสุขภาพที่เป็นปัญหาและความต้องการด้านสุขภาพของประชาชนในชุมชน",
					IsCorrect: true,
				},
			},
		},
		{
			Text:           "ข้อใดคือกระบวนการการประเมินชุมชน",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "เก็บรวบรวมข้อมูลชุมชน วิเคราะห์และนำเสนอข้อมูล ระบุปัญหาและจัดลำดับความมสำคัญของปัญหา",
					IsCorrect: true,
				},
				{
					Text:      "ตั้งคำถามหรือปัญหา ตั้งสมมติฐาน ออกแบบการทดลอง เก็บรวบรวมข้อมูล วิเคราะห์และแปลผลข้อมูล สรุปผล เผยแพร่ผลการศึกษา",
					IsCorrect: false,
				},
				{
					Text:      "ประเมิน วินิจฉัย วางแผนการพยาบาล ปฏิบัติการพยาบาล ประเมินผลการพยาบาล",
					IsCorrect: false,
				},
				{
					Text:      "ประเมินความต้องการด้านสุขภาพ กำหนดเป้าหมายและวัตถุประสงค์ วางแผนกิจกรรมส่งเสริมสุขภาพ ดำเนินกิจกรรม ประเมินผล",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "ข้อใดคือข้อมูลทุตติยภูมิ",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "แบบฟอร์มการลงทะเบียนผู้ป่วย", IsCorrect: false},
				{Text: "ผลการตรวจเลือด", IsCorrect: false},
				{Text: "รายงานวิเคราะห์สถานการณ์โรคในชุมชน", IsCorrect: true},
				{
					Text:      "ข้อมูลสุขภาพที่ได้จากการสัมภาษณ์ผู้ป่วย",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "สิ่งแวดล้อมในชุมชนหมายถึงอะไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "สิ่งที่มนุษย์สร้างขึ้นเพียงอย่างเดียว", IsCorrect: false},
				{
					Text:      "สิ่งต่าง ๆ ที่อยู่รอบตัวมนุษย์ทั้งทางธรรมชาติและที่มนุษย์สร้างขึ้น",
					IsCorrect: true,
				},
				{Text: "ขนบธรรมเนียมและประเพณีในชุมชนเท่านั้น", IsCorrect: false},
				{
					Text:      "สิ่งที่ไม่ส่งผลกระทบต่อชีวิตของคนในชุมชน",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "ข้อใดไม่ใช่บทบาทของอาสาสมัครสาธารณสุขประจำหมู่บ้าน (อสม.)?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "ให้คำแนะนำด้านสุขภาพแก่ประชาชน", IsCorrect: false},
				{Text: "ช่วยเฝ้าระวังโรคในชุมชน", IsCorrect: false},
				{
					Text:      "เป็นผู้ตัดสินใจเกี่ยวกับนโยบายสุขภาพระดับประเทศ",
					IsCorrect: true,
				},
				{Text: "ติดตามผู้ป่วยในชุมชน", IsCorrect: false},
			},
		},
		{
			Text:           "การกระจายอำนาจในระบบสุขภาพชุมชนช่วยให้เกิดผลดีในด้านใด?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "การกำหนดนโยบายสุขภาพที่ตอบสนองความต้องการในพื้นที่",
					IsCorrect: true,
				},
				{
					Text:      "การควบคุมงบประมาณจากส่วนกลางได้ง่ายขึ้น",
					IsCorrect: false,
				},
				{Text: "การลดบทบาทของชุมชนในระบบสุขภาพ", IsCorrect: false},
				{Text: "การรวมศูนย์การบริหารจัดการที่ส่วนกลาง", IsCorrect: false},
			},
		},
		{
			Text:           "ทุนทางสังคมในระดับหน่วยงานและแหล่งประโยชน์แตกต่างจากระดับกลุ่มทางสังคมอย่างไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "ระดับหน่วยงานเน้นการจัดการข้อมูลในครอบครัวส่วนกลุ่มทางสังคมเน้นการช่วยเหลือกันในชุมชน",
					IsCorrect: false,
				},
				{
					Text:      "ระดับหน่วยงานมีความเกี่ยวข้องกับองค์กรภายนอก เช่น อบต. หรือศูนย์ กศน. ส่วนกลุ่มทางสังคมเกิดจากการรวมตัวของคนในชุมชนเอง",
					IsCorrect: true,
				},
				{
					Text:      "ระดับหน่วยงานทำงานในระดับตำบลส่วนกลุ่มทางสังคมเน้นการทำงานระดับเครือข่าย",
					IsCorrect: false,
				},
				{
					Text:      "ระดับหน่วยงานมุ่งเน้นการแก้ไขปัญหาเศรษฐกิจส่วนกลุ่มทางสังคมมุ่งเน้นการพัฒนาวัฒนธรรม",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "สิ่งแวดล้อมทางสังคมในชุมชนหมายถึงอะไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "การจัดการทรัพยากรธรรมชาติในชุมชน", IsCorrect: false},
				{
					Text:      "ความสัมพันธ์ของผู้คน วิถีชีวิต และวัฒนธรรมในชุมชน",
					IsCorrect: true,
				},
				{
					Text:      "สิ่งที่มนุษย์สร้างขึ้น เช่น อาคารและถนน",
					IsCorrect: false,
				},
				{Text: "พื้นที่เศรษฐกิจ เช่น ตลาดและโรงงาน", IsCorrect: false},
			},
		},
		{
			Text:           "ความหมายของ \"ชุมชน\" คืออะไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "กลุ่มคนที่อาศัยอยู่ในพื้นที่เดียวกันโดยไม่มีผลประโยชน์ร่วมกัน",
					IsCorrect: false,
				},
				{
					Text:      "หมู่ชนที่รวมกันเป็นสังคมขนาดเล็กในบริเวณเดียวกันและมีผลประโยชน์ร่วมกัน",
					IsCorrect: true,
				},
				{Text: "กลุ่มบุคคลที่รวมกันเพื่อทำงานเฉพาะกิจ", IsCorrect: false},
				{Text: "กลุ่มคนที่แยกกันอยู่อย่างอิสระ", IsCorrect: false},
			},
		},
		{
			Text:           "ข้อใดไม่ใช่ประชากร 13 กลุ่ม",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "คนพิการ หญิงตั้งครรภ์", IsCorrect: false},
				{Text: "ผู้ป่วยจิตเวช ผู้ป่วยเอดส์", IsCorrect: false},
				{Text: "นักโทษ พระสงฆ์", IsCorrect: true},
				{Text: "ผู้ป่วยระยะท้าย ผู้สูงอายุ", IsCorrect: false},
			},
		},
	},
}

var PostTest = Test{
	Title:       "Post-test",
	TotalPoints: 10,
	Questions: []Question{
		{
			Text:           "ข้อใดคือความหมายของการประเมินชุมชน",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "การรวบรวมข้อมูลประชากรในชุมชนเพื่อวิเคราะห์เชิงเศรษฐกิจและสังคม",
					IsCorrect: false,
				},
				{
					Text:      "การจัดทำโครงการสุขภาพในชุมชนโดยไม่พิจารณาปัญหาสุขภาพเบื้องต้น",
					IsCorrect: false,
				},
				{
					Text:      "การสรุปสภาพแวดล้อมและทรัพยากรในชุมชนโดยไม่เน้นการมีส่วนร่วมของประชาชน",
					IsCorrect: false,
				},
				{
					Text:      "การระบุสถานะสุขภาพที่เป็นปัญหาและความต้องการด้านสุขภาพของประชาชนในชุมชน",
					IsCorrect: true,
				},
			},
		},
		{
			Text:           "ข้อใดคือกระบวนการการประเมินชุมชน",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "เก็บรวบรวมข้อมูลชุมชน วิเคราะห์และนำเสนอข้อมูล ระบุปัญหาและจัดลำดับความมสำคัญของปัญหา",
					IsCorrect: true,
				},
				{
					Text:      "ตั้งคำถามหรือปัญหา ตั้งสมมติฐาน ออกแบบการทดลอง เก็บรวบรวมข้อมูล วิเคราะห์และแปลผลข้อมูล สรุปผล เผยแพร่ผลการศึกษา",
					IsCorrect: false,
				},
				{
					Text:      "ประเมิน วินิจฉัย วางแผนการพยาบาล ปฏิบัติการพยาบาล ประเมินผลการพยาบาล",
					IsCorrect: false,
				},
				{
					Text:      "ประเมินความต้องการด้านสุขภาพ กำหนดเป้าหมายและวัตถุประสงค์ วางแผนกิจกรรมส่งเสริมสุขภาพ ดำเนินกิจกรรม ประเมินผล",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "ข้อใดคือข้อมูลทุตติยภูมิ",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "แบบฟอร์มการลงทะเบียนผู้ป่วย", IsCorrect: false},
				{Text: "ผลการตรวจเลือด", IsCorrect: false},
				{Text: "รายงานวิเคราะห์สถานการณ์โรคในชุมชน", IsCorrect: true},
				{
					Text:      "ข้อมูลสุขภาพที่ได้จากการสัมภาษณ์ผู้ป่วย",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "สิ่งแวดล้อมในชุมชนหมายถึงอะไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "สิ่งที่มนุษย์สร้างขึ้นเพียงอย่างเดียว", IsCorrect: false},
				{
					Text:      "สิ่งต่าง ๆ ที่อยู่รอบตัวมนุษย์ทั้งทางธรรมชาติและที่มนุษย์สร้างขึ้น",
					IsCorrect: true,
				},
				{Text: "ขนบธรรมเนียมและประเพณีในชุมชนเท่านั้น", IsCorrect: false},
				{
					Text:      "สิ่งที่ไม่ส่งผลกระทบต่อชีวิตของคนในชุมชน",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "ข้อใดไม่ใช่บทบาทของอาสาสมัครสาธารณสุขประจำหมู่บ้าน (อสม.)?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "ให้คำแนะนำด้านสุขภาพแก่ประชาชน", IsCorrect: false},
				{Text: "ช่วยเฝ้าระวังโรคในชุมชน", IsCorrect: false},
				{
					Text:      "เป็นผู้ตัดสินใจเกี่ยวกับนโยบายสุขภาพระดับประเทศ",
					IsCorrect: true,
				},
				{Text: "ติดตามผู้ป่วยในชุมชน", IsCorrect: false},
			},
		},
		{
			Text:           "การกระจายอำนาจในระบบสุขภาพชุมชนช่วยให้เกิดผลดีในด้านใด?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "การกำหนดนโยบายสุขภาพที่ตอบสนองความต้องการในพื้นที่",
					IsCorrect: true,
				},
				{
					Text:      "การควบคุมงบประมาณจากส่วนกลางได้ง่ายขึ้น",
					IsCorrect: false,
				},
				{Text: "การลดบทบาทของชุมชนในระบบสุขภาพ", IsCorrect: false},
				{Text: "การรวมศูนย์การบริหารจัดการที่ส่วนกลาง", IsCorrect: false},
			},
		},
		{
			Text:           "ทุนทางสังคมในระดับหน่วยงานและแหล่งประโยชน์แตกต่างจากระดับกลุ่มทางสังคมอย่างไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "ระดับหน่วยงานเน้นการจัดการข้อมูลในครอบครัวส่วนกลุ่มทางสังคมเน้นการช่วยเหลือกันในชุมชน",
					IsCorrect: false,
				},
				{
					Text:      "ระดับหน่วยงานมีความเกี่ยวข้องกับองค์กรภายนอก เช่น อบต. หรือศูนย์ กศน. ส่วนกลุ่มทางสังคมเกิดจากการรวมตัวของคนในชุมชนเอง",
					IsCorrect: true,
				},
				{
					Text:      "ระดับหน่วยงานทำงานในระดับตำบลส่วนกลุ่มทางสังคมเน้นการทำงานระดับเครือข่าย",
					IsCorrect: false,
				},
				{
					Text:      "ระดับหน่วยงานมุ่งเน้นการแก้ไขปัญหาเศรษฐกิจส่วนกลุ่มทางสังคมมุ่งเน้นการพัฒนาวัฒนธรรม",
					IsCorrect: false,
				},
			},
		},
		{
			Text:           "สิ่งแวดล้อมทางสังคมในชุมชนหมายถึงอะไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "การจัดการทรัพยากรธรรมชาติในชุมชน", IsCorrect: false},
				{
					Text:      "ความสัมพันธ์ของผู้คน วิถีชีวิต และวัฒนธรรมในชุมชน",
					IsCorrect: true,
				},
				{
					Text:      "สิ่งที่มนุษย์สร้างขึ้น เช่น อาคารและถนน",
					IsCorrect: false,
				},
				{Text: "พื้นที่เศรษฐกิจ เช่น ตลาดและโรงงาน", IsCorrect: false},
			},
		},
		{
			Text:           "ความหมายของ \"ชุมชน\" คืออะไร?",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{
					Text:      "กลุ่มคนที่อาศัยอยู่ในพื้นที่เดียวกันโดยไม่มีผลประโยชน์ร่วมกัน",
					IsCorrect: false,
				},
				{
					Text:      "หมู่ชนที่รวมกันเป็นสังคมขนาดเล็กในบริเวณเดียวกันและมีผลประโยชน์ร่วมกัน",
					IsCorrect: true,
				},
				{Text: "กลุ่มบุคคลที่รวมกันเพื่อทำงานเฉพาะกิจ", IsCorrect: false},
				{Text: "กลุ่มคนที่แยกกันอยู่อย่างอิสระ", IsCorrect: false},
			},
		},
		{
			Text:           "ข้อใดไม่ใช่ประชากร 13 กลุ่ม",
			Points:         1.0,
			IsMultiCorrect: false,
			Options: []Option{
				{Text: "คนพิการ หญิงตั้งครรภ์", IsCorrect: false},
				{Text: "ผู้ป่วยจิตเวช ผู้ป่วยเอดส์", IsCorrect: false},
				{Text: "นักโทษ พระสงฆ์", IsCorrect: true},
				{Text: "ผู้ป่วยระยะท้าย ผู้สูงอายุ", IsCorrect: false},
			},
		},
	},
}
